In [3]:
#dependecies 
import pandas as pd

In [4]:
data_df = pd.read_csv("Resources/DataScience_salaries_2024.csv")
data_df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L
...,...,...,...,...,...,...,...,...,...,...,...
14833,2022,MI,FT,Business Intelligence Developer,15000,USD,15000,GH,100,GH,M
14834,2020,EX,FT,Staff Data Analyst,15000,USD,15000,NG,0,CA,M
14835,2021,EN,FT,Machine Learning Developer,15000,USD,15000,TH,100,TH,L
14836,2022,EN,FT,Data Analyst,15000,USD,15000,ID,0,ID,L
14837,2020,EN,PT,ML Engineer,14000,EUR,15966,DE,100,DE,S

In [5]:
year_sort_df = data_df.sort_values('work_year')
year_sort_df.reset_index(drop = True)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,EX,FT,Staff Data Analyst,15000,USD,15000,NG,0,CA,M
1,2020,EN,PT,Data Scientist,19000,EUR,21669,IT,50,IT,S
2,2020,SE,FT,Data Science Manager,190200,USD,190200,US,100,US,M
3,2020,SE,FT,Lead Data Scientist,190000,USD,190000,US,100,US,S
4,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
...,...,...,...,...,...,...,...,...,...,...,...
14833,2024,EN,FT,Big Data Engineer,17600,USD,17600,MX,50,MX,L
14834,2024,EN,FT,Data Analyst,23000,GBP,28750,GB,0,GB,M
14835,2024,EN,FT,Data Analyst,23000,GBP,28750,GB,0,GB,M
14836,2024,EN,PT,Data Science,15000,EUR,16666,DE,50,DE,M
14837,2024,EN,FT,Data Analyst,23000,GBP,28750,GB,0,GB,M